ychong0711-ops/stm32-learning/02_source_code/main_fixed.c
// 직전 부팅의 리셋 원인(RCC->CSR 상위 플래그)입니다. IWDG_Init() 으로 워치독을
// 켜기 전에 읽어 두어야 하며, 디버거나 다음 부팅에서 워치독 리셋 여부를
// 판별하는 근거가 됩니다. (통합 계층 보강)
static volatile uint32_t ulResetCause = 0U; // 직전 리셋 원인 플래그를 보존합니다.

// ---- 워치독 하트비트 및 업데이트 플래그 (수정 1) ---- 
static volatile uint32_t ulHeartbeat_CAN_Rx = 0U; // CAN 수신 태스크의 하트비트 카운터입니다.
static volatile uint32_t ulHeartbeat_Sensor = 0U; // 센서 태스크의 하트비트 카운터입니다.
static volatile uint32_t ulHeartbeat_Actuator = 0U; // 액추에이터 태스크의 하트비트 카운터입니다.
static volatile uint32_t ulHeartbeat_Debug = 0U; // 디버깅 태스크의 하트비트 카운터입니다.
static volatile BaseType_t xFirmwareUpdateActive = pdFALSE; // 펌웨어 업데이트 진행 중 여부 플래그입니다.
// 32비트 카운터가 한 검사 주기(100ms) 안에 2^32번 증가할 수 없으므로,
// 이전 값과의 단순 비교만으로도 오버플로(wrap)에 안전합니다. 

// ---- 긴급 정지 래치 (2차 수정) ---- 
static volatile BaseType_t xEmergencyStopLatched = pdFALSE; // 긴급 정지 래치 플래그. 설정되면 안전 상태 해제는 시스템 리셋으로만 가능합니다.

// ---- 오류 카운터: 빈 문장(;) 대신 실제 진단용 카운터로 대체 ---- 
static volatile uint32_t ulErrCount_ActuatorQueueFull = 0U; // 액추에이터 명령 큐 가득 참 횟수입니다.
static volatile uint32_t ulErrCount_SensorQueueFull = 0U; // 센서 데이터 큐 가득 참 횟수입니다.
static volatile uint32_t ulErrCount_ActuatorMutexFail = 0U; // 액추에이터 뮤텍스 획득 실패 횟수입니다.
static volatile uint32_t ulErrCount_DebugMutexFail = 0U; // 디버그 뮤텍스 획득 실패 횟수입니다.
static volatile uint32_t ulErrCount_FirmwareStageInvalid = 0U; // 스테이징 이미지 검증 실패 횟수입니다.
static volatile uint32_t ulErrCount_EmergencyLatchedDrop = 0U; // (2차 수정) 긴급 정지 래치 중 버려진 과거 명령의 횟수입니다.

void vTask_Watchdog(void *pvParameters); // 워치독 태스크 함수의 프로토타입을 선언합니다.
void vTask_CAN_Rx(void *pvParameters); // CAN 수신 태스크 함수의 프로토타입을 선언합니다.
void vTask_Sensor(void *pvParameters); // 센서 수집 태스크 함수의 프로토타입을 선언합니다.
void vTask_Actuator(void *pvParameters); // 액추에이터 제어 태스크 함수의 프로토타입을 선언합니다.
void vTask_Debug(void *pvParameters); // 디버깅 태스크 함수의 프로토타입을 선언합니다.
void vTask_Firmware(void *pvParameters); // 펌웨어 업데이트 태스크 함수의 프로토타입을 선언합니다.

static void prvConvertCanToActuatorCmd(const CAN_Message_t *pxCanMsg, // CAN 원본 메시지 포인터를 인자로 받습니다.
                                       ActuatorCmd_t *pxCmd); // 변환된 액추에이터 명령을 저장할 포인터를 인자로 받습니다.
static void prvApplyActuatorCommand(const ActuatorCmd_t *pxCmd); // 액추에이터 명령을 실제 하드웨어에 적용하는 함수 프로토타입입니다.
static void prvEmergencyStop(void); // 긴급 정지를 즉시 적용하는 함수 프로토타입입니다.
static void prvRequestFirmwareInstall(void); // 스테이징 이미지를 검증하고 설치를 요청하는 함수 프로토타입입니다.

// --------------------------------------------------------------------------
// 워치독 태스크 (수정 1)
// 모든 태스크의 하트비트가 갱신되고 있을 때만 IWDG를 피드합니다.
// 하나라도 멈춘 태스크가 있으면 피드하지 않아 IWDG가 시스템을 리셋시키도록 합니다.
// 펌웨어 업데이트 중에는 다른 태스크가 정지되므로 업데이트 플래그를 보고 무조건 피드합니다.
// -------------------------------------------------------------------------- 
void vTask_Watchdog(void *pvParameters) // 워치독 태스크 함수를 정의합니다.
{ // 워치독 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    uint32_t ulPrevHeartbeat_CAN_Rx = 0U; // 이전 주기의 CAN 하트비트 값을 저장합니다.
    uint32_t ulPrevHeartbeat_Sensor = 0U; // 이전 주기의 센서 하트비트 값을 저장합니다.
    uint32_t ulPrevHeartbeat_Actuator = 0U; // 이전 주기의 액추에이터 하트비트 값을 저장합니다.
    uint32_t ulPrevHeartbeat_Debug = 0U; // 이전 주기의 디버그 하트비트 값을 저장합니다.
    const TickType_t xPeriod = pdMS_TO_TICKS(WATCHDOG_CHECK_PERIOD_MS); // 검사 주기 100ms를 틱 단위로 변환합니다.
    TickType_t xLastWakeTime = xTaskGetTickCount(); // 주기 지연을 위해 현재 틱으로 마지막 깨어남 시각을 초기화합니다.

    for (;;) // 워치독 태스크의 무한 루프를 시작합니다.
    { // 워치독 태스크 루프 본문을 시작합니다.
        if (xFirmwareUpdateActive != pdFALSE) // 펌웨어 업데이트가 진행 중인지 확인합니다.
        { // 펌웨어 업데이트 중 처리 블록을 시작합니다.
            IWDG_ReloadCounter(); // 업데이트 중에는 업데이터를 신뢰하고 무조건 IWDG를 피드합니다.
        } // 펌웨어 업데이트 중 처리 블록을 종료합니다.
        else if ((ulHeartbeat_CAN_Rx != ulPrevHeartbeat_CAN_Rx) && // CAN 태스크 하트비트가 갱신되었는지 확인합니다.
                 (ulHeartbeat_Sensor != ulPrevHeartbeat_Sensor) && // 센서 태스크 하트비트가 갱신되었는지 확인합니다.
                 (ulHeartbeat_Actuator != ulPrevHeartbeat_Actuator) && // 액추에이터 태스크 하트비트가 갱신되었는지 확인합니다.
                 (ulHeartbeat_Debug != ulPrevHeartbeat_Debug)) // 디버그 태스크 하트비트가 갱신되었는지 확인합니다.
        { // 모든 태스크 정상 동작 확인 블록을 시작합니다.
            IWDG_ReloadCounter(); // 모든 태스크가 살아있으므로 IWDG를 피드합니다.
        } // 모든 태스크 정상 동작 확인 블록을 종료합니다.
        else // 하나 이상의 태스크가 멈춘 경우입니다.
        { // 태스크 이상 감지 블록을 시작합니다.
            ; // 의도적으로 피드하지 않습니다. IWDG 타임아웃으로 시스템이 리셋됩니다.
              // 실제 제품에서는 리셋 직전에 어떤 태스크가 멈췄는지 UART로 기록하면 좋습니다.
        } // 태스크 이상 감지 블록을 종료합니다.

        ulPrevHeartbeat_CAN_Rx = ulHeartbeat_CAN_Rx; // 다음 비교를 위해 CAN 하트비트 값을 갱신합니다.
        ulPrevHeartbeat_Sensor = ulHeartbeat_Sensor; // 다음 비교를 위해 센서 하트비트 값을 갱신합니다.
        ulPrevHeartbeat_Actuator = ulHeartbeat_Actuator; // 다음 비교를 위해 액추에이터 하트비트 값을 갱신합니다.
        ulPrevHeartbeat_Debug = ulHeartbeat_Debug; // 다음 비교를 위해 디버그 하트비트 값을 갱신합니다.

        vTaskDelayUntil(&xLastWakeTime, xPeriod); // 다음 100ms 검사 주기까지 태스크를 지연시킵니다.
    } // 워치독 태스크 무한 루프를 종료합니다.
} // 워치독 태스크 함수를 종료합니다.

void vTask_CAN_Rx(void *pvParameters) // CAN 수신 태스크 함수를 정의합니다.
{ // CAN 수신 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    CAN_Message_t xRxMsg; // CAN에서 수신한 메시지를 저장할 변수입니다.
    ActuatorCmd_t xCmd; // CAN 메시지를 변환한 액추에이터 명령을 저장할 변수입니다.
    BaseType_t xStatus; // CAN 수신 성공 여부를 저장할 변수입니다.

    CAN_Init(CAN_SPEED_500KBPS); // CAN 컨트롤러를 500kbps 속도로 초기화합니다.
    CAN_FilterConfig(0x000, 0x000); // 모든 CAN 메시지를 수신하도록 필터를 설정합니다.

    for (;;) // CAN 수신 태스크의 무한 루프를 시작합니다.
    { // CAN 수신 태스크 루프 본문을 시작합니다.
        ulHeartbeat_CAN_Rx++; // 워치독이 이 태스크의 생존을 확인하도록 하트비트를 증가시킵니다.

        xStatus = CAN_Receive(&xRxMsg, pdMS_TO_TICKS(CAN_RX_TIMEOUT_MS)); // 10ms 타임아웃으로 CAN 메시지 수신을 시도합니다.
        if (xStatus == pdPASS) // CAN 메시지 수신에 성공했는지 확인합니다.
        { // CAN 메시지 수신 성공 처리 블록을 시작합니다.
            if (xRxMsg.ID == CAN_ID_EMERGENCY) // 수신된 CAN ID가 긴급 정지 ID인지 확인합니다.
            { // 긴급 정지 처리 블록을 시작합니다.
                prvEmergencyStop(); // (수정 2) 큐를 거치지 않고 즉시 안전 상태를 적용합니다.
            } // 긴급 정지 처리 블록을 종료합니다.
            else // 일반 제어 명령인 경우입니다.
            { // 일반 제어 명령 처리 블록을 시작합니다.
                prvConvertCanToActuatorCmd(&xRxMsg, &xCmd); // 수신된 CAN 메시지를 액추에이터 명령 구조체로 변환합니다.
                if (xCmd.commandId != CMD_NONE) // 변환된 명령이 실제 제어 대상 명령인지 확인합니다.
                { // 액추에이터 명령 처리 블록을 시작합니다.
                    if (xQueueSend(xQueue_ActuatorCmd, &xCmd, 0U) != pdPASS) // 액추에이터 명령 큐에 명령 전송을 시도하고 실패 여부를 확인합니다.
                    { // 액추에이터 명령 큐 전송 실패 처리 블록을 시작합니다.
                        ulErrCount_ActuatorQueueFull++; // 큐 가득 참으로 명령이 유실된 횟수를 기록합니다.
                    } // 액추에이터 명령 큐 전송 실패 처리 블록을 종료합니다.
                } // 액추에이터 명령 처리 블록을 종료합니다.
            } // 일반 제어 명령 처리 블록을 종료합니다.
        } // CAN 메시지 수신 성공 처리 블록을 종료합니다.
        // IWDG 피드는 이 태스크가 아닌 워치독 전용 태스크가 담당합니다. 
    } // CAN 수신 태스크 무한 루프를 종료합니다.
} // CAN 수신 태스크 함수를 종료합니다.

