ychong0711-ops/stm32-learning/02_source_code/main_fixed.c
        case CMD_FAN: // 팬 명령인 경우입니다.
            GPIO_Write(GPIO_PIN_FAN, pxCmd->state); // 팬 GPIO 핀에 명령 상태를 적용합니다.
            break; // 팬 명령 처리를 종료합니다.

        case CMD_EMERGENCY_STOP: // 긴급 정지 명령인 경우입니다.
            PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정하여 출력을 차단합니다.
            GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
            break; // 긴급 정지 명령 처리를 종료합니다.

        case CMD_NONE: // 명령 없음인 경우입니다.
        default: // 알 수 없는 명령인 경우입니다.
            break; // 추가 하드웨어 동작 없이 종료합니다.
    } // 명령 switch 블록을 종료합니다.
} // 액추에이터 명령 적용 함수를 종료합니다.

// --------------------------------------------------------------------------
// 긴급 정지 (수정 2 + 2차 수정 래치)
// 큐를 거치지 않고 호출 즉시 안전 상태를 적용합니다.
// 뮤텍스는 portMAX_DELAY로 획득을 보장하므로 명령이 유실되지 않습니다.
// (2차 수정) 적용 후 안전 상태를 래치하여, 큐에 남아 있던 과거 명령이
// 액추에이터를 재가동하는 것을 시스템 리셋 전까지 차단합니다.
// -------------------------------------------------------------------------- 
static void prvEmergencyStop(void) // 긴급 정지 함수를 정의합니다.
{ // 긴급 정지 함수 본문을 시작합니다.
    xEmergencyStopLatched = pdTRUE; // (2차 수정) 안전 상태를 래치합니다. 해제는 시스템 리셋으로만 가능합니다.
    if (xSemaphoreTake(xSemaphore_Actuator, portMAX_DELAY) == pdTRUE) // 긴급 경로이므로 무한 대기로 액추에이터 뮤텍스 획득을 보장합니다.
    { // 액추에이터 뮤텍스 획득 성공 블록을 시작합니다.
        PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정하여 출력을 차단합니다.
        GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
        xSemaphoreGive(xSemaphore_Actuator); // 사용이 끝난 액추에이터 뮤텍스를 반환합니다.
    } // 액추에이터 뮤텍스 획득 성공 블록을 종료합니다.
    else // 뮤텍스 획득에 실패한 경우입니다. (portMAX_DELAY 사용 시 도달하지 않아야 함)
    { // 뮤텍스 획득 실패 방어 블록을 시작합니다.
        // 이론상 도달하지 않지만, 안전이 최우선이므로 뮤텍스 없이도 안전 출력을 시도합니다. 
        PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 PWM을 0으로 설정합니다.
        GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 GPIO를 OFF로 설정합니다.
    } // 뮤텍스 획득 실패 방어 블록을 종료합니다.
} // 긴급 정지 함수를 종료합니다.

void vTask_Debug(void *pvParameters) // 디버깅 태스크 함수를 정의합니다.
{ // 디버깅 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    SensorData_t xSensorData; // 디버깅 출력에 사용할 센서 데이터를 저장할 변수입니다.
    BaseType_t xStatus; // 센서 큐 수신 성공 여부를 저장할 변수입니다.
    int32_t lTempX100; // 온도를 0.01℃ 단위 정수로 저장할 변수입니다.

    UART_Init(UART_BAUD_115200); // 디버깅용 UART를 115200bps로 초기화합니다.

    for (;;) // 디버깅 태스크의 무한 루프를 시작합니다.
    { // 디버깅 태스크 루프 본문을 시작합니다.
        ulHeartbeat_Debug++; // 워치독이 이 태스크의 생존을 확인하도록 하트비트를 증가시킵니다.

        xStatus = xQueueReceive(xQueue_Sensor_Data, &xSensorData, pdMS_TO_TICKS(DEBUG_QUEUE_TIMEOUT_MS)); // 센서 데이터 큐에서 데이터 수신을 시도합니다.
        if (xStatus == pdPASS) // 센서 데이터 큐에서 데이터를 정상적으로 수신했는지 확인합니다.
        { // 센서 데이터 수신 성공 처리 블록을 시작합니다.
            if (xSemaphoreTake(xMutex_Debug, pdMS_TO_TICKS(DEBUG_MUTEX_TIMEOUT_MS)) == pdTRUE) // UART 출력 보호용 뮤텍스 획득을 시도합니다.
            { // 디버그 뮤텍스 획득 성공 블록을 시작합니다.
                // newlib-nano에서는 float 출력이 기본 미지원이므로(-u _printf_float 옵션 필요),
// 온도를 0.01℃ 단위 정수로 변환하여 출력합니다. 이렇게 하면 링커 옵션
// 의존성과 float printf의 코드 크기/스택 부담을 모두 제거할 수 있습니다. 
                lTempX100 = (int32_t)(xSensorData.temperature * 100.0f); // 온도(float)를 0.01℃ 단위 정수로 변환합니다.
                printf("{\"ts\":%lu,\"rpm\":%u,\"temp_x100\":%ld,\"throttle\":%u}\r\n", // JSON 형식 로그 포맷 문자열입니다.
                       (unsigned long)xSensorData.timestamp, // 로그의 타임스탬프 인자입니다.
                       (unsigned int)xSensorData.rpm, // 로그의 RPM 인자입니다.
                       (long)lTempX100, // 로그의 온도 인자입니다. (0.01℃ 단위)
                       (unsigned int)xSensorData.throttle); // 로그의 스로틀 인자입니다.
                xSemaphoreGive(xMutex_Debug); // 사용이 끝난 디버그 뮤텍스를 반환합니다.
            } // 디버그 뮤텍스 획득 성공 블록을 종료합니다.
            else // 디버그 뮤텍스 획득에 실패한 경우입니다.
            { // 디버그 뮤텍스 획득 실패 블록을 시작합니다.
                ulErrCount_DebugMutexFail++; // 출력 누락(뮤텍스 실패) 횟수를 기록합니다.
            } // 디버그 뮤텍스 획득 실패 블록을 종료합니다.
        } // 센서 데이터 수신 성공 처리 블록을 종료합니다.

        vTaskDelay(pdMS_TO_TICKS(50U)); // 디버깅 태스크가 CPU를 과도하게 점유하지 않도록 50ms 지연합니다.
    } // 디버깅 태스크 무한 루프를 종료합니다.
} // 디버깅 태스크 함수를 종료합니다.

// --------------------------------------------------------------------------
// 펌웨어 설치 요청 (스테이징 패턴으로 전환)
//
// [기존 구조의 문제 — 셀프 플래싱]
//   예전에는 이 함수가 Bootloader_FlashNewFirmware() 를 호출해, 실행 중인
//   애플리케이션이 자기 자신이 들어 있는 플래시 영역을 지우고 다시 썼습니다.
//   이 구조는 원리적으로 복구가 불가능합니다.
//     1) 자기 코드를 지우는 순간부터 리셋되면 부팅할 코드 자체가 없습니다.
//        (전원 순단, 워치독 타임아웃, 브라운아웃 — 모두 현실에서 일어납니다)
//     2) 플래시 삭제/기록 중에는 같은 뱅크에서 명령을 페치할 수 없어,
//        플래싱 루틴 전체를 RAM 으로 옮기지 않으면 버스 폴트가 납니다.
//     3) 수신한 이미지가 손상되었어도 이미 원본을 지운 뒤라 되돌릴 수 없습니다.
//
// [바뀐 구조 — 스테이징]
//   실행 중인 코드는 절대 자기 영역을 건드리지 않습니다.
//     수신 → 스테이징 영역(섹터 5, 0x08020000)에 기록  ← 앱이 하는 일은 여기까지
//     검증 → CRC-32 + 헤더 + 벡터 테이블 유효성 확인
//     요청 → 백업 SRAM 의 BootCtrl 블록에 "설치 요청" 기록
//     리셋 → 섹터 0 의 부트로더가 검증·복사·점프를 수행
//   앱 영역을 지우는 주체가 부트로더(다른 섹터에서 실행)로 바뀌므로 위 3가지
//   문제가 모두 사라지고, 복사 도중 전원이 끊겨도 다음 부팅에서 부트로더가
//   시도 횟수를 보고 재설치하거나 복구 모드로 진입합니다.
//
// 따라서 이 함수는 더 이상 플래시를 쓰지 않습니다. 검증과 요청만 남습니다.
// -------------------------------------------------------------------------- 
static void prvRequestFirmwareInstall(void) // 펌웨어 설치 요청 함수를 정의합니다.
{ // 펌웨어 설치 요청 함수 본문을 시작합니다.
    IWDG_ReloadCounter(); // 요청 처리 진입 직전에 IWDG를 피드하여 타임아웃 여유를 확보합니다.

    // 스테이징 이미지를 마지막으로 한 번 더 검증합니다. 여기서 실패하면
// 설치 요청을 기록하지 않으므로 리셋도 일어나지 않고, 현재 펌웨어가 그대로
// 계속 동작합니다. (셀프 플래싱에서는 불가능했던 "안전한 취소"입니다) 
    if (Bootloader_VerifyStaged() != FW_IMAGE_OK) // 스테이징 영역 이미지의 CRC와 헤더를 검증합니다.
    { // 스테이징 이미지 검증 실패 처리 블록을 시작합니다.
        Bootloader_AbortStaging(); // 손상된 스테이징 이미지를 무효화합니다.
        xFirmwareUpdateActive = pdFALSE; // 워치독 태스크를 정상 감시 모드로 되돌립니다.
        IWDG_ReloadCounter(); // 정상 복귀 직전에 IWDG를 한 번 더 피드합니다.
        return; // 리셋하지 않고 현재 펌웨어로 계속 동작합니다.
    } // 스테이징 이미지 검증 실패 처리 블록을 종료합니다.

    IWDG_ReloadCounter(); // 리셋 직전에 한 번 더 피드하여 안전 마진을 확보합니다.

    // 백업 SRAM 에 설치 요청을 기록하고 NVIC_SystemReset() 을 호출합니다.
// 이 함수는 정상적으로 반환하지 않습니다. 리셋 후 섹터 0 의 부트로더가
// 스테이징 → 앱 영역 복사를 수행합니다. 
    Bootloader_RequestInstallAndReset(); // 설치를 요청하고 시스템을 리셋합니다.
} // 펌웨어 설치 요청 함수를 종료합니다.

void vTask_Firmware(void *pvParameters) // 펌웨어 업데이트 태스크 함수를 정의합니다.
{ // 펌웨어 업데이트 태스크 함수 본문을 시작합니다.
    (void)pvParameters; // 사용하지 않는 태스크 파라미터로 인한 경고를 방지합니다.
    FirmwareState_t xState; // 펌웨어 업데이트 요청 상태를 저장할 변수입니다.
    const TickType_t xCheckPeriod = pdMS_TO_TICKS(FIRMWARE_CHECK_PERIOD_MS); // 업데이트 요청 확인 주기 5초를 틱으로 변환합니다.

