ychong0711-ops/stm32-learning/02_source_code/main_fixed.c
    Flash_Init(); // 플래시 메모리 제어 모듈을 초기화합니다.
    Bootloader_Init(); // 부트로더 인터페이스를 초기화합니다.

    for (;;) // 펌웨어 업데이트 태스크의 무한 루프를 시작합니다.
    { // 펌웨어 업데이트 태스크 루프 본문을 시작합니다.
        xState = Bootloader_CheckUpdateRequest(); // 부트로더 영역 또는 플래그에서 업데이트 요청을 확인합니다.
        if (xState == UPDATE_AVAILABLE) // 펌웨어 업데이트 요청이 존재하는지 확인합니다.
        { // 펌웨어 업데이트 처리 블록을 시작합니다.
            xFirmwareUpdateActive = pdTRUE; // 워치독 태스크가 무조건 피드하도록 업데이트 플래그를 설정합니다.

            // 업데이트 전에 안전 상태를 적용합니다. (액추에이터 뮤텍스로 보호) 
            if (xSemaphoreTake(xSemaphore_Actuator, portMAX_DELAY) == pdTRUE) // 액추에이터 뮤텍스 획득을 보장합니다.
            { // 안전 상태 적용 블록을 시작합니다.
                PWM_SetDuty(PWM_CHANNEL_THROTTLE, 0U); // 스로틀 출력을 0으로 안전화합니다.
                GPIO_Write(GPIO_PIN_FAN, 0U); // 팬 출력을 OFF로 안전화합니다.
                xSemaphoreGive(xSemaphore_Actuator); // 사용이 끝난 액추에이터 뮤텍스를 반환합니다.
            } // 안전 상태 적용 블록을 종료합니다.

            if (xTaskHandle_CAN_Rx != NULL) // CAN 태스크 핸들이 유효한지 확인합니다.
            { // CAN 태스크 정지 블록을 시작합니다.
                vTaskSuspend(xTaskHandle_CAN_Rx); // CAN 수신 태스크를 정지합니다.
            } // CAN 태스크 정지 블록을 종료합니다.
            if (xTaskHandle_Sensor != NULL) // 센서 태스크 핸들이 유효한지 확인합니다.
            { // 센서 태스크 정지 블록을 시작합니다.
                vTaskSuspend(xTaskHandle_Sensor); // 센서 수집 태스크를 정지합니다.
            } // 센서 태스크 정지 블록을 종료합니다.
            if (xTaskHandle_Actuator != NULL) // 액추에이터 태스크 핸들이 유효한지 확인합니다.
            { // 액추에이터 태스크 정지 블록을 시작합니다.
                vTaskSuspend(xTaskHandle_Actuator); // 액추에이터 제어 태스크를 정지합니다.
            } // 액추에이터 태스크 정지 블록을 종료합니다.
            if (xTaskHandle_Debug != NULL) // 디버깅 태스크 핸들이 유효한지 확인합니다.
            { // 디버깅 태스크 정지 블록을 시작합니다.
                vTaskSuspend(xTaskHandle_Debug); // 디버깅 태스크를 정지합니다.
            } // 디버깅 태스크 정지 블록을 종료합니다.
            // 워치독 태스크는 정지하지 않습니다: 업데이트 플래그를 보고 무조건 피드합니다. 

            // 스테이징 패턴에서는 이 태스크가 플래시를 쓰지 않으므로
// vTaskSuspendAll() 로 스케줄러를 멈출 필요가 없습니다.
// (오히려 멈추면 워치독 태스크까지 정지해 위험합니다. 예전 셀프 플래싱
//  구조에서 스케줄러를 멈춰야 했던 이유는 플래시 기록 중 컨텍스트 스위치를
//  막기 위해서였습니다.)
// 여기서 하는 일은 "검증 + 요청 기록 + 리셋" 뿐이며 수 밀리초면 끝납니다. 
            prvRequestFirmwareInstall(); // 스테이징 이미지를 검증하고 설치를 요청한 뒤 리셋합니다.

            // 여기에 도달했다는 것은 스테이징 이미지 검증에 실패해 설치를
// 취소했다는 뜻입니다. 현재 펌웨어로 계속 동작하며 다음 주기에 다시
// 확인합니다. (검증 성공 시에는 위에서 리셋되어 도달하지 않습니다) 
            ulErrCount_FirmwareStageInvalid++; // 스테이징 이미지 검증 실패 횟수를 기록합니다.

            // 정지시켰던 태스크들을 되살려 정상 운전으로 복귀합니다.
// 셀프 플래싱 구조에서는 "되돌아온다"는 개념 자체가 없었지만,
// 스테이징 구조에서는 설치를 취소하고 원래 상태로 돌아올 수 있습니다. 
            if (xTaskHandle_Debug != NULL) // 디버깅 태스크 핸들이 유효한지 확인합니다.
            { // 디버깅 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Debug); // 디버깅 태스크를 재개합니다.
            } // 디버깅 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_Actuator != NULL) // 액추에이터 태스크 핸들이 유효한지 확인합니다.
            { // 액추에이터 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Actuator); // 액추에이터 제어 태스크를 재개합니다.
            } // 액추에이터 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_Sensor != NULL) // 센서 태스크 핸들이 유효한지 확인합니다.
            { // 센서 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_Sensor); // 센서 수집 태스크를 재개합니다.
            } // 센서 태스크 재개 블록을 종료합니다.
            if (xTaskHandle_CAN_Rx != NULL) // CAN 태스크 핸들이 유효한지 확인합니다.
            { // CAN 태스크 재개 블록을 시작합니다.
                vTaskResume(xTaskHandle_CAN_Rx); // CAN 수신 태스크를 재개합니다.
            } // CAN 태스크 재개 블록을 종료합니다.

            xFirmwareUpdateActive = pdFALSE; // 워치독 태스크를 정상 하트비트 감시 모드로 되돌립니다.
        } // 펌웨어 업데이트 처리 블록을 종료합니다.

        vTaskDelay(xCheckPeriod); // 다음 업데이트 요청 확인까지 5초 동안 태스크를 지연합니다.
    } // 펌웨어 업데이트 태스크 무한 루프를 종료합니다.
} // 펌웨어 업데이트 태스크 함수를 종료합니다.

int main(void) // 프로그램 진입점 main 함수를 정의합니다.
{ // main 함수 본문을 시작합니다.
    BaseType_t xCreateResult = pdFAIL; // 태스크 생성 결과를 저장할 변수입니다.

    // ---- 통합 계층: HAL 초기화 (반드시 다른 어떤 HAL 호출보다 먼저) ----
// HAL_Init() 은 (1) 플래시 프리페치/명령·데이터 캐시를 켜고, (2) NVIC 우선순위
// 그룹을 4(서브 우선순위 없음)로 설정하며, (3) SysTick 을 1ms 타임베이스로
// 시작하고 HAL_Delay()/HAL_GetTick() 이 동작하게 만듭니다.
// 이 호출이 없으면 BMP280_Init() 안의 HAL_Delay(10) 이 영원히 반환하지 않고,
// HAL 드라이버의 타임아웃 처리도 전부 무력화됩니다. 
    HAL_Init(); // HAL 라이브러리와 1ms 타임베이스(SysTick)를 초기화합니다.

    SystemClock_Config(); // 시스템 클록을 180MHz로 설정합니다.

    // SystemClock_Config() 가 HCLK 를 16MHz(HSI) → 180MHz 로 바꾸었으므로
// SysTick 재적재값을 새 클록에 맞춰 다시 계산해야 1ms 틱이 유지됩니다.
// (HAL_RCC_ClockConfig() 내부에서 HAL_InitTick() 을 다시 호출하지만,
//  SystemCoreClock 갱신과 함께 명시적으로 한 번 더 맞춰 둡니다.) 
    SystemCoreClockUpdate(); // RCC 레지스터를 읽어 SystemCoreClock 전역을 갱신합니다.
    (void)HAL_InitTick(TICK_INT_PRIORITY); // 새 클록 기준으로 HAL 타임베이스를 재설정합니다.

    // HAL_Init() 이 이미 그룹 4로 설정하지만, 의존 관계를 코드에 남기기 위해
// 명시적으로 한 번 더 호출합니다. FreeRTOS Cortex-M 포트는 "서브 우선순위 없음"
// (모든 비트가 선점 우선순위)을 전제로 configMAX_SYSCALL_INTERRUPT_PRIORITY 를
// 판정하므로 이 설정은 필수입니다.
// 주의: NVIC_PriorityGroup_4 는 구형 SPL 매크로라 HAL 에는 존재하지 않습니다.
//       HAL 의 NVIC_PRIORITYGROUP_4 를 사용해야 컴파일됩니다. (정적 증빙 결함 #2) 
    NVIC_PriorityGroupConfig(NVIC_PRIORITYGROUP_4); // STM32 NVIC 우선순위 그룹을 4로 설정합니다.

    // ---- 통합 계층: 독립 워치독 시작 ----
// 워치독 태스크의 점검 주기는 100ms 이므로, 타임아웃은 그보다 충분히 큰 1초로
// 잡습니다. IWDG 는 한 번 켜면 소프트웨어로 끌 수 없으므로 스케줄러 시작 직전에
// 시작해야 하며, 리셋 원인 플래그는 켜기 전에 읽어 두어야 의미가 있습니다. 
    ulResetCause = IWDG_GetResetFlags(); // 직전 리셋 원인(RCC->CSR 플래그)을 보존합니다.
    IWDG_ClearResetFlags(); // 다음 부팅에서 원인을 구분할 수 있도록 플래그를 지웁니다.

    // [타임아웃 산정 근거] 워치독 타임아웃은 "정상 동작 중 피드가 끊길 수 있는
    // 가장 긴 구간"보다 커야 합니다. 이 앱에서 그 구간은 태스크 주기가 아니라
    // 스테이징 영역 삭제입니다.
    //
    // Bootloader_BeginStaging() 은 128KB 단일 섹터(섹터 5)를 삭제하는데,
    // STM32F446 의 128KB 섹터 삭제는 전형 1초 / 최악 2초가 걸립니다. 더 중요한 것은
    // 삭제 중 CPU 가 같은 뱅크에서 명령을 페치하지 못해 완전히 멈춘다는 점입니다.
    // 멈춰 있는 동안에는 어떤 태스크도 실행되지 않으므로 IWDG 를 피드할 수 없습니다.
    // (Flash_SetProgressHook() 은 삭제 "전후"에만 호출될 뿐, 삭제 "도중"에는
    //  CPU 가 정지해 있어 아무것도 실행할 수 없습니다.)
    //
    // 따라서 1초 타임아웃으로는 정상적인 펌웨어 수신조차 워치독 리셋을 유발합니다.
    // 최악 삭제 시간 2초에 LSI 편차(공칭 32kHz, 실제 17~47kHz)를 고려한 마진을
    // 더해 4초로 설정합니다. LSI 가 빠른 쪽으로 치우쳐도 실제 타임아웃이
    // 2초 아래로 내려가지 않도록 하는 값입니다.
    //
    // 트레이드오프: 태스크 정지 검출이 1초에서 4초로 느려집니다. 이를 보완하기 위해
    // 워치독 태스크는 100ms 주기 하트비트 검사를 그대로 유지하며, 하트비트가
    // 끊기면 IWDG 만료를 기다리지 않고 스스로 피드를 멈춥니다.
    IWDG_Init(4000U); // 독립 워치독을 4초 타임아웃으로 시작합니다. (최악 섹터 삭제 2초 + 마진)

    xQueue_ActuatorCmd = xQueueCreate(ACTUATOR_CMD_QUEUE_LEN, sizeof(ActuatorCmd_t)); // 액추에이터 명령 큐를 생성합니다.
    xQueue_Sensor_Data = xQueueCreate(SENSOR_DATA_QUEUE_LEN, sizeof(SensorData_t)); // 센서 데이터 큐를 생성합니다.
    xSemaphore_Actuator = xSemaphoreCreateMutex(); // 액추에이터 보호용 뮤텍스를 생성합니다.
    xMutex_Debug = xSemaphoreCreateMutex(); // 디버그 출력 보호용 뮤텍스를 생성합니다.

    configASSERT(xQueue_ActuatorCmd); // 액추에이터 명령 큐 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xQueue_Sensor_Data); // 센서 데이터 큐 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xSemaphore_Actuator); // 액추에이터 뮤텍스 생성 실패 시 시스템을 중단시킵니다.
    configASSERT(xMutex_Debug); // 디버그 뮤텍스 생성 실패 시 시스템을 중단시킵니다.

