ychong0711-ops/stm32-learning/02_source_code/main_fixed.c
    // 태스크 생성 결과도 검사합니다.
// 주의: xTaskCreate() 호출을 configASSERT() 인자 안에 직접 넣으면,
// configASSERT가 비활성화된 빌드에서 태스크 생성 자체가 생략될 수 있습니다.
// 따라서 아래처럼 생성과 검사를 분리합니다. 
    xCreateResult = xTaskCreate(vTask_Watchdog, "Watchdog", TASK_WATCHDOG_STACK_SIZE, NULL, TASK_WATCHDOG_PRIORITY, &xTaskHandle_Watchdog); // 워치독 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 워치독 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_CAN_Rx, "CAN_Rx", TASK_CAN_STACK_SIZE, NULL, TASK_CAN_PRIORITY, &xTaskHandle_CAN_Rx); // CAN 수신 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // CAN 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Sensor, "Sensor", TASK_SENSOR_STACK_SIZE, NULL, TASK_SENSOR_PRIORITY, &xTaskHandle_Sensor); // 센서 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 센서 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Actuator, "Actuator", TASK_ACTUATOR_STACK_SIZE, NULL, TASK_ACTUATOR_PRIORITY, &xTaskHandle_Actuator); // 액추에이터 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 액추에이터 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Debug, "Debug", TASK_DEBUG_STACK_SIZE, NULL, TASK_DEBUG_PRIORITY, &xTaskHandle_Debug); // 디버그 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 디버그 태스크 생성 실패 시 시스템을 중단시킵니다.
    xCreateResult = xTaskCreate(vTask_Firmware, "Firmware", TASK_FIRMWARE_STACK_SIZE, NULL, TASK_FIRMWARE_PRIORITY, &xTaskHandle_Firmware); // 펌웨어 업데이트 태스크를 생성합니다.
    configASSERT(xCreateResult == pdPASS); // 펌웨어 태스크 생성 실패 시 시스템을 중단시킵니다.

    vTaskStartScheduler(); // FreeRTOS 스케줄러를 시작합니다.
    for (;;) // 스케줄러가 종료되는 비정상 상황을 대비한 무한 루프입니다.
    { // main 무한 루프 본문을 시작합니다.
    } // main 무한 루프 본문을 종료합니다.
    return 0; // main 함수 반환값입니다. 일반적으로 도달하지 않습니다.
} // main 함수를 종료합니다.
